Hello @scott-the-programmer. Everything ok. I appreciate your feedback, thanks.

### Terraform execution result

```
$ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # minikube_cluster.docker will be created
  + resource "minikube_cluster" "docker" {
      + addons                     = [
          + "dashboard",
          + "default-storageclass",
          + "ingress",
          + "storage-provisioner",
        ]
      + apiserver_ips              = (known after apply)
      + apiserver_name             = "minikubeCA"
      + apiserver_names            = (known after apply)
      + apiserver_port             = 8443
      + auto_update_drivers        = true
      + base_image                 = "gcr.io/k8s-minikube/kicbase:v0.0.40@sha256:8cadf23777709e43eca447c47a45f5a4635615129267ce025193040ec92a1631"
      + cache_images               = true
      + cert_expiration            = 1576800
      + client_certificate         = (sensitive value)
      + client_key                 = (sensitive value)
      + cluster_ca_certificate     = (sensitive value)
      + cluster_name               = "terraform"
      + container_runtime          = "docker"
      + cpus                       = 2
      + delete_on_failure          = false
      + disable_driver_mounts      = false
      + disable_metrics            = false
      + disable_optimizations      = false
      + disk_size                  = "20000mb"
      + dns_domain                 = "cluster.local"
      + dns_proxy                  = false
      + download_only              = false
      + driver                     = "docker"
      + dry_run                    = false
      + embed_certs                = false
      + enable_default_cni         = false
      + extra_disks                = 0
      + force                      = false
      + force_systemd              = false
      + host                       = (known after apply)
      + host_dns_resolver          = true
      + host_only_cidr             = "192.168.59.1/24"
      + host_only_nic_type         = "virtio"
      + hyperkit_vsock_ports       = (known after apply)
      + hyperv_use_external_switch = false
      + id                         = (known after apply)
      + insecure_registry          = (known after apply)
      + install_addons             = true
      + interactive                = true
      + iso_url                    = (known after apply)
      + keep_context               = false
      + kvm_gpu                    = false
      + kvm_hidden                 = false
      + kvm_network                = "default"
      + kvm_numa_count             = 1
      + kvm_qemu_uri               = "qemu:///system"
      + memory                     = "4000mb"
      + mount                      = false
      + mount_9p_version           = "9p2000.L"
      + mount_gid                  = "docker"
      + mount_msize                = 262144
      + mount_port                 = 0
      + mount_string               = "/home:/minikube-host"
      + mount_type                 = "9p"
      + mount_uid                  = "docker"
      + namespace                  = "default"
      + nat_nic_type               = "virtio"
      + native_ssh                 = true
      + nfs_share                  = (known after apply)
      + nfs_shares_root            = "/nfsshares"
      + no_kubernetes              = false
      + no_vtx_check               = false
      + nodes                      = 4
      + ports                      = (known after apply)
      + preload                    = true
      + registry_mirror            = (known after apply)
      + service_cluster_ip_range   = "10.96.0.0/12"
      + ssh_port                   = 22
      + ssh_user                   = "root"
      + vm                         = false
      + wait_timeout               = 6
    }

Plan: 1 to add, 0 to change, 0 to destroy.
minikube_cluster.docker: Creating...
minikube_cluster.docker: Still creating... [10s elapsed]
minikube_cluster.docker: Still creating... [20s elapsed]
minikube_cluster.docker: Still creating... [30s elapsed]
minikube_cluster.docker: Still creating... [40s elapsed]
minikube_cluster.docker: Still creating... [50s elapsed]
minikube_cluster.docker: Still creating... [1m0s elapsed]
minikube_cluster.docker: Still creating... [1m10s elapsed]
minikube_cluster.docker: Still creating... [1m20s elapsed]
minikube_cluster.docker: Still creating... [1m30s elapsed]
minikube_cluster.docker: Still creating... [1m40s elapsed]
minikube_cluster.docker: Still creating... [1m50s elapsed]
minikube_cluster.docker: Still creating... [2m0s elapsed]
minikube_cluster.docker: Still creating... [2m10s elapsed]
minikube_cluster.docker: Still creating... [2m20s elapsed]
minikube_cluster.docker: Still creating... [2m30s elapsed]
minikube_cluster.docker: Still creating... [2m40s elapsed]
minikube_cluster.docker: Still creating... [2m50s elapsed]
minikube_cluster.docker: Creation complete after 2m53s [id=terraform]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

### Minikube profiles

$ minikube profile list
|-----------|-----------|---------|--------------|------|---------|---------|-------|--------|
|  Profile  | VM Driver | Runtime |      IP      | Port | Version | Status  | Nodes | Active |
|-----------|-----------|---------|--------------|------|---------|---------|-------|--------|
| spot      | docker    | docker  | 192.168.58.2 | 8443 | v1.27.4 | Stopped |     4 |        |
| terraform | docker    | docker  | 192.168.67.2 | 8443 | v1.27.1 | Running |     4 |        |
|-----------|-----------|---------|--------------|------|---------|---------|-------|--------|
